test/system/simpleSettings/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object controlDict;
}
    application rhoSimpleFoam;
    startFrom startTime;
    startTime 0;
    stopAt endTime;
    endTime 500;
    deltaT 1;
    writeControl timeStep; //adjustableRunTime;
    writeInterval 1; //0.001;
    purgeWrite 0;
    writeFormat ascii;
    writePrecision 10;
    writeCompression uncompressed;
    timeFormat general;
    timePrecision 10;
    graphFormat raw;
    runTimeModifiable true;
    adjustTimeStep true;
    maxCo 1.0;
    maxDeltaT 1.0;
