test/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;


// Geometry. Definition of all surfaces. All surfaces are of class
geometry
{
	bottom.stl {type triSurfaceMesh; name bottom;}
	outer.stl {type triSurfaceMesh; name outer;}
	symmetryY.stl {type triSurfaceMesh; name symmetryY;}
	symmetryX.stl {type triSurfaceMesh; name symmetryX;}	
	top.stl {type triSurfaceMesh; name top;}
	nozzleInlet.stl {type triSurfaceMesh; name nozzleInlet;}
	nozzleHolder.stl {type triSurfaceMesh; name nozzleHolder;}
//	bottomPlane  
//    {
//        type searchablePlate;
//        origin (0 0 0 );
//        span ( 0.5 0.5 0);
//    }
    	refinementCylinder
    {
        type searchableCylinder;
        point1 (0  0  0);
        point2 (0  0  0.1);
	radius 0.03; 
    } 
};


// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    maxLocalCells 200000;
    maxGlobalCells 3000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 5;

    // Explicit feature edge refinement
    features
    (
	{file "nozzleInlet.eMesh"; level 4;}
        {file "nozzleHolder.eMesh"; level 3;}
	{file "bottom.eMesh"; level 1;}
	{file "top.eMesh"; level 0;}
	{file "outer.eMesh"; level 0;}
	{file "symmetryX.eMesh"; level 0;}
	{file "symmetryY.eMesh"; level 0;}
    );

    // Surface based refinement
    refinementSurfaces
    {
	nozzleInlet 
		{level (4 4);
		patchInfo
		{
			type patch;
		}}
	nozzleHolder 		
		{level (3 3);
		patchInfo
		{
			type wall;
		}}
	bottom 		
		{level (1 3);
		patchInfo
		{
			type wall;
		}}
	top 		
		{level (0 0);
		patchInfo
		{
			type wall;
		}}
	symmetryX 		
		{level (0 0);
		patchInfo
		{
			type symmetryPlane;
		}}
	symmetryY 		
		{level (0 0);
		patchInfo
		{
			type symmetryPlane;
		}}

	outer 		
		{level (0 0);
		patchInfo
		{
			type wall;
		}}

    }
    // Resolve sharp angles
    resolveFeatureAngle 30;

    // Region-wise refinement
    refinementRegions
    {
        refinementCylinder
        {
            mode inside;
            levels ((1E15 3));
        }
    }
    // Mesh selection
    locationInMesh (0.02 0.02 0.02);
    allowFreeStandingZoneFaces true;
}


// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;

    // Feature snapping
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        "(nozzleHolder).*"
        {
            nSurfaceLayers 3;
        }
        "bottom"
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;

    // Advanced settings
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

// Generic mesh quality settings.
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;

    // Advanced
    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;
mergeTolerance 1e-6;


// ************************************************************************* //
