test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7010;
        startFace       13771;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7010;
        startFace       20781;
    }
    nozzleInlet
    {
        type            patch;
        nFaces          6;
        startFace       27791;
    }
    outer
    {
        type            patch;
        nFaces          65;
        startFace       27797;
    }
    shieldInlet
    {
        type            patch;
        nFaces          15;
        startFace       27862;
    }
    shieldOutlet
    {
        type            patch;
        nFaces          15;
        startFace       27877;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       27892;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          102;
        startFace       27988;
    }
    shield
    {
        type            wall;
        inGroups        1(wall);
        nFaces          134;
        startFace       28090;
    }
)

// ************************************************************************* //
