test/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;		
    transport       sutherland; // work on this part of the incompressiblePoly part
    thermo          janaf; 
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

// dpdt no;

chemistryReader foamChemistryReader;

foamChemistryThermoFile "$FOAM_CASE/constant/foam.dat";  //thermo.incompressiblePoly";

foamChemistryFile "$FOAM_CASE/constant/foam.inp"; //reactions";

inertSpecie     air;
/*
liquids
{
    H2O;
    //paint; 	// add later the properties in the thermo.incompressiblePoly
}
*/


liquids
{
    H2O;
    paint; 	// add later the properties in the thermo.incompressiblePoly
}

solids
{}


/* 
thermoType
{
    type            hePsiThermo;
    mixture         homogeneousMixture; //reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}


CHEMKINFile     "$FOAM_CASE/chemkin/chem.inp";
CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";
CHEMKINTransportFile "$FOAM_CASE/chemkin/transportProperties";


newFormat       yes;
*/



// ************************************************************************* //
