test/system/oldBlockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

R 1.;		// very large to facilitate all meshes
H 0.3;

halfAngle 45.0;

//Calculuate the xy positions
/*
radHalfAngle    #calc "degToRad($halfAngle)";
x       	#calc "$R*sin($radHalfAngle)";
minx    	#calc "-1.0*$x";
y       	#calc "$R*cos($radHalfAngle)";
miny    	#calc "-1.0*$y";

vertices
(
    (0 0 0)   		// 0
    (0 0 $H)		// 1
    (0 0 $H)		// 2
    (0 0 0)		// 3
    (0 $R 0)		// 4
    (0 $R $H)		// 5
    ($R  0 $H)		// 6
    ($R 0 0)		// 7
);
*/

vertices
(
    (0   0  0)   		// 0
    ($R  0  0)			// 1
    ($R $R  0)			// 2
    (0  $R  0)			// 3
    (0   0 $H)			// 4
    ($R  0 $H)			// 5
    ($R $R $H)			// 6
    (0  $R $H)			// 7
);

blocks // basic block is 10mm
(
    hex (0 1 2 3 4 5 6 7) (100 100 30) simpleGrading (1 1 1) 
);

/*
edges
(
    arc 4 7 ($x $y 0)
    arc 5 6 ($x $y $H)
);
*/

edges
(
);


boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    symmetryX
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    symmetryY
    {
        type symmetryPlane;
        faces
        (
            (3 0 4 7)
        );
    }

    outer
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (2 3 7 6)
        );
    }
);
// ************************************************************************* //
